#### AnalyticalFixityState Enumeration

---

|  |
| --- |
| See Also |

Specifies the fixity setting of individual degrees of freedom in analytical release conditions.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum AnalyticalFixityState ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalyticalFixityState ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalyticalFixityState ``` |

# Members

| Member name | Description |
| --- | --- |
| Fixed | Degree of freedom is Fixed. |
| Released | Degree of freedom is Released. |
| Spring | Degree of freedom has a Spring coefficient. |

# See Also

Autodesk.Revit.DB.Structure Namespace